/**
 * @file   BatDamageMotion.h
 *
 * @brief  コウモリのダメージリアクションモーションに関するヘッダファイル
 *
 * @author 制作者名　福地貴翔
 *
 * @date   日付　2025/09/05
 */

 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include"../Motion.h"
#include"Game/Object/Enemy/Bat/Bat.h"
// クラスの宣言 ===============================================================
class Sound;
// クラスの定義 ===============================================================
/**
  * @brief コウモリのダメージリアクションモーション
  */
class BatDamageMotion : public Motion
{
// クラス定数の宣言 -------------------------------------------------
public:


// データメンバの宣言 -----------------------------------------------
private:
	//コウモリのポインタ
	Bat* m_pBat;


	std::unique_ptr<Sound> m_wingSound;
// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	BatDamageMotion(Bat* pBat);

	// デストラクタ
	~BatDamageMotion();


// 操作
public:
	void Initialize();

	bool Update();


	void Reset();

//　取得・設定
public:

//　内部操作
private:

};

