/**
 * @file   World.h
 *
 * @brief  世界の設定に関するヘッダファイル
 *
 * @author 制作者名　福地貴翔
 *
 * @date   日付　2025/01/02
 */

 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================

// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief 世界の設定
  */
class World
{
// クラス定数の宣言 -------------------------------------------------
public:
	//重力
	static constexpr float GRAVITY = -0.89f;
	//地上摩擦
	static constexpr float GROUND_FRICTION = 0.95f;
// データメンバの宣言 -----------------------------------------------
private:

// メンバ関数の宣言 -------------------------------------------------
public:

};

