/**
 * @file   XXXX.h
 *
 * @brief  XXXXに関するヘッダファイル
 *
 * @author 制作者名
 *
 * @date   日付
 */

 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include"Game/Common/Graphics.h"
// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief XXXX
  */
class XXXX
{
// クラス定数の宣言 -------------------------------------------------
public:


// データメンバの宣言 -----------------------------------------------
private:
	Graphics* m_graphics;	// グラフィックスクラスのポインタ
// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	XXXX();

	// デストラクタ
	~XXXX();


// 操作
public:
	void Initialize();

	void Update();

	void Draw();

	void Finalize();
//　取得・設定
public:

//　内部操作
private:

};

