/**
 * @file   IUI.h
 *
 * @brief  UIのインターフェイス定義に関するヘッダファイル
 *
 * @author 制作者名  福地貴翔
 *
 * @date   日付
 */

 // 多重インクルードの防止 =====================================================
#pragma once
#ifndef IUI_DEFINED
#define IUI_DEFINED

// ヘッダファイルの読み込み ===================================================


// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief モーションを定義
  */
class IUI
{
// クラス定数の宣言 -------------------------------------------------
public:

// データメンバの宣言 -----------------------------------------------
private:

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:

	// デストラクタ
	virtual ~IUI() =default;


// 操作
public:
	virtual void Initialize() =0;

	virtual void Update()=0;


	virtual void Render()=0;

//　取得・設定
public:

//　内部操作
private:

};

#endif	// IOBSERVER_DEFINED
