/**
 * @file   IUI.h
 *
 * @brief  UIのインターフェイス定義に関するヘッダファイル
 *
 * @author 制作者名  福地貴翔
 *
 * @date   日付　2026/01/18
 */
 // 多重インクルードの防止 =====================================================
#pragma once
#ifndef IUI_DEFINED
#define IUI_DEFINED
// ヘッダファイルの読み込み ===================================================

// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief UIクラスを定義
  */
class IUI
{
// クラス定数の宣言 -------------------------------------------------
public:

// メンバ関数の宣言 -------------------------------------------------
//　取得・設定
public:
// コンストラクタ/デストラクタ
public:
	// デストラクタ
	virtual ~IUI() =default;
// 操作
public:
	//初期化
	virtual void Initialize() =0;
	//更新
	virtual void Update()=0;
	//描画
	virtual void Render()=0;
};

#endif	// IUI_DEFINED
