/**
 * @file   AvoidCommand.h
 *
 * @brief  回避コマンドに関するヘッダファイル
 *
 * @author 制作者名　福地貴翔
 *
 * @date   日付　2026/03/22
 */
 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include"Game/Interface/ICommand.h"
// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief 回避コマンド
  */
class AvoidCommand : public ICommand
{
// クラス定数の宣言 -------------------------------------------------
public:


// メンバ関数の宣言 -------------------------------------------------
//　取得・設定
public:
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	AvoidCommand();
	// デストラクタ
	~AvoidCommand();


// 操作
public:
	//コマンド実行
	void Execute(const int& objectID) override;

//　内部操作
private:
// データメンバの宣言 -----------------------------------------------
private:


};

