/**
 * @file   StatusUpGem.h
 *
 * @brief  ステータスが上がる宝石に関するヘッダファイル
 *
 * @author 制作者名　福地貴翔
 *
 * @date   日付  2026/01/19
 */
 // 多重インクルードの防止 =====================================================
#pragma once
// ヘッダファイルの読み込み ===================================================
#include"../Gem.h"
// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief ステータスが上がる宝石
  */
class StatusUpGem : public Gem
{
// クラス定数の宣言 -------------------------------------------------
public:


// メンバ関数の宣言 -------------------------------------------------
//取得・設定
public:
// コンストラクタ/デストラクタ
	// コンストラクタ
	// 宝石の種類と効果値を指定して初期化
	StatusUpGem(const Gem::GemAbility& ability, const Gem::GemImagePath& image);
	//コピー用
	StatusUpGem(const StatusUpGem& other) = default;
	// デストラクタ
	~StatusUpGem();
//操作
public:
	//多態コピー
	std::unique_ptr<Gem> Clone()const override;
	//初期化
	void Initialize();
	//終了
	void Finalize();
//内部操作
private:

// データメンバの宣言 -----------------------------------------------
private:
};