/**
 * @file   StatusUpGem.h
 *
 * @brief  宝石に関するヘッダファイル
 *
 * @author 制作者名　福地貴翔
 *
 * @date   日付  2025/08/27
 */

 // 多重インクルードの防止 =====================================================
#pragma once
#include <string>

// ヘッダファイルの読み込み ===================================================
#include"../Gem/Gem.h"
// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief 宝石
  */
class StatusUpGem : public Gem
{
// クラス定数の宣言 -------------------------------------------------
public:

// データメンバの宣言 -----------------------------------------------
private:
// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	StatusUpGem();
	// 宝石の種類と効果値を指定して初期化
	StatusUpGem(Gem::GemAbility ability,Gem::GemImagePath image);

	// デストラクタ
	~StatusUpGem();


//操作
public:
	void Initialize();


	void Finalize();
//取得・設定
public:
//内部操作
private:

};

