/**
 * @file   Motion.h
 *
 * @brief  モーションの基底に関するヘッダファイル
 *
 * @author 制作者名  福地貴翔
 *
 * @date   日付
 */

 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include"../Motion/MotionType.h"
#include"Game/Common/Sound.h"

// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief モーションの基底
  */
class Motion
{
// クラス定数の宣言 -------------------------------------------------
public:

// データメンバの宣言 -----------------------------------------------
private:
	//モーションの補間値
	float m_motionLerp = 0.0f;
// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	Motion();

	// デストラクタ
	virtual ~Motion();


// 操作
public:
	//初期化
	virtual void Initialize()=0;

	//更新
	virtual bool Update() = 0;

	//リセット
	virtual void Reset();

//　取得・設定
public:


	//モーション補間値の取得
	float GetMotionLerp() const;
	//モーション補間値の設定
	void SetMotionLerp(const float& motionLerp);
//　内部操作
private:

};

