/**
 * @file   MotionType.h
 *
 * @brief  モーション種類に関するヘッダファイル
 *
 * @author 制作者名  福地貴翔
 *
 * @date   日付 2026/01/18
 */
 // 多重インクルードの防止 =====================================================
#pragma once
// ヘッダファイルの読み込み ===================================================

// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief モーションの種類
  */
class MotionType
{
// クラス定数の宣言 -------------------------------------------------
public:
	//プレイヤーの地上攻撃
	enum PlayerGroundAttack : int
	{
		COMBO1=0,	// コンボ1
		COMBO2,		// コンボ2
		COMBO3,		// コンボ3
	};
	//プレイヤーの空中攻撃
	enum PlayerAirAttack : int 
	{
		JUMP
	};
};