/**
 * @file   MotionType.h
 *
 * @brief  モーション種類に関するヘッダファイル
 *
 * @author 制作者名  福地貴翔
 *
 * @date   日付
 */

 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================


// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief モーションの種類
  */
class MotionType
{

public:
	enum PlayerGroundAttack : int
	{
		COMBO1=0,	// コンボ1
		COMBO2,		// コンボ2
		COMBO3,		// コンボ3
	};

	enum PlayerAirAttack : int 
	{
		JUMP
	};
};

