/**
 * @file   Hand.h
 *
 * @brief  手に関するヘッダファイル
 *
 * @author 制作者名
 *
 * @date   日付
 */

 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include "Game/Object/GameObject.h"

// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief Hand
  */
class Hand
{
// クラス定数の宣言 -------------------------------------------------
public:


// データメンバの宣言 -----------------------------------------------
private:
	Graphics* m_graphics;	// グラフィックスクラスのポインタ
// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	// コンストラクタ
	Hand();

	// デストラクタ
	~Hand();


// 操作
public:
	void Initialize();

	void Update();

	void Draw();

	void Finalize();
//　取得・設定
public:

//　内部操作
private:

};

