/**
 * @file   OutlineRenderer.h
 *
 * @brief  アウトライン描画に関するヘッダファイル
 *
 * @author 制作者名　福地貴翔
 *
 * @date   日付  2025/01/03
 */

 // 多重インクルードの防止 =====================================================
#pragma once

// ヘッダファイルの読み込み ===================================================
#include"Game/Common/Graphics.h"
// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief アウトライン描画
  */
class OutlineRenderer
{
	// クラス定数の宣言 -------------------------------------------------
public:


// データメンバの宣言 -----------------------------------------------
private:

// メンバ関数の宣言 -------------------------------------------------
// コンストラクタ/デストラクタ
public:
	

// 操作
public:
	//アウトライン描画
	static void Draw(
		const DirectX::Model& model,
		const DirectX::SimpleMath::Matrix& world,
		const float& thickness
	);
//　取得・設定
public:

//　内部操作
private:

};

