/**
 * @file   OutlineRenderer.h
 *
 * @brief  アウトライン描画に関するヘッダファイル
 *
 * @author 制作者名　福地貴翔
 *
 * @date   日付  2026/01/29
 */
 // 多重インクルードの防止 =====================================================
#pragma once
// ヘッダファイルの読み込み ===================================================
#include <Model.h>
#include <SimpleMath.h>
// クラスの宣言 ===============================================================

// クラスの定義 ===============================================================
/**
  * @brief アウトライン描画
  */
class OutlineRenderer
{
// クラス定数の宣言 -------------------------------------------------
public:

// メンバ関数の宣言 -------------------------------------------------
//　取得・設定
public:
// コンストラクタ/デストラクタ
	
// 操作
	//アウトライン描画
	static void Draw(
		const DirectX::Model& model,
		const DirectX::SimpleMath::Matrix& world,
		const float& thickness
	);
//　内部操作
private:

// データメンバの宣言 -----------------------------------------------
private:
};

